package operators_circles;
/*Составьте программу, выводящую на экран квадраты чисел от 10 до 20
включительно.*/
public class elevTask {

	public static void main(String[] args) {
		int x=0;
		int y = 0;
		for ( x = 10; x <= 20; x++){
		  y = x * x;
		  System.out.println(y);
		}



		  }

		}
